# pandas toturial part 2

what is going to be discussed is selecting specific values of a pandas DataFrame or Series to work on.

#### what is an accessors?
as it interoduce itself, it gives access; when a class has an accessor, it allows to the private members be accessible on other scopes. the most simple examole of an accessor function could be the 'getter' and 'setter' of a function. These below are a few sample of accessors:

In [3]:
import array 
     
arr = array.array('i', [5, 1, 3, 4, 2, 2, 7])
 
# Accesses the index of the value in argument
print (arr.index(2))
 
# Accesses the number of time the
# stated value is present
print (arr.count(2))
 
# Mutates the array list
(arr.append(19))
 
# Prints the array after alteration
print (arr)

4
2
array('i', [5, 1, 3, 4, 2, 2, 7, 19])

To learn more about the accessors, [read here](https://www.geeksforgeeks.org/accessor-and-mutator-methods-in-python/).

---

Native Python objects provide good ways of indexing data. Pandas carries all of these over.
here is how to Access an Attribute of a **class** Instance:
Use the dot notation (.):

In [4]:
class Book:
    def __init__(self, title, author):
        self.title = title    # instance attribute
        self.author = author  # instance attribute

    def get_info(self):
        return f"'{self.title}' by {self.author}"


my_book = Book("1984", "George Orwell")
my_book

In [5]:
my_book.title

'1984'

In [6]:
my_book.author

'George Orwell'

and here is a sample of accessing a Value in a Dictionary:
Use the bracket notation with a key (\['key']):

In [7]:
# my_book['title']
my_book = {
    'title': '1984',
    'author': 'George Orwell',
    'year': 1949
}

my_book

{'title': '1984', 'author': 'George Orwell', 'year': 1949}

In [8]:
my_book['title']

'1984'

In [9]:
my_book['author']

'George Orwell'

---
Now, what does python accessors have to do with **pandas**? 
the answer is here: the dataFrames uses the dame way:

In [10]:
import pandas as pd
arr = pd.DataFrame({'scores': [20, 19, 18, 17], 'students': ['sam', 'pam', 'jym', 'kim']}, index=['rank1', 'rank2', 'rank3', 'rank4'])
arr

       scores students
rank1      20      sam
rank2      19      pam
rank3      18      jym
rank4      17      kim

now let's see how to access the values:
both ways of using (.) and ([]) are avialble here!

In [11]:
arr.scores

rank1    20
rank2    19
rank3    18
rank4    17
Name: scores, dtype: int64

In [12]:
arr['scores']

rank1    20
rank2    19
rank3    18
rank4    17
Name: scores, dtype: int64

here is another fun usage of the ([]) notation: accessing a single value, using the second ([]) notation that indicates the row number.

In [13]:
arr['scores']['rank3']

18

this is another way to relate the DataFrames in pandas and simple dictionries in python:

In [17]:
my_dict = {
    'scores': [20, 19, 18, 17],
    'students': ['sam', 'pam', 'jym', 'kim'],
    'last Name': ['do', 're', 'fa', 'sol']
}

table = pd.DataFrame(my_dict, index=['rank1', 'rank2', 'rank3', 'rank4'])
table

       scores students last Name
rank1      20      sam        do
rank2      19      pam        re
rank3      18      jym        fa
rank4      17      kim       sol

here is a fun fact that shows a benefit of using ([]) rather that the (.): consider the last name that has an space (considerd as an special character). now the approach \['last Name'] is possible, but the .last Name is not possible!

In [32]:
table['last Name']

rank1     do
rank2     re
rank3     fa
rank4    sol
Name: last Name, dtype: object

---

### Indexing in pandas
pandas has its own accessor operators, *loc* (label-based selection) and *iloc* (index-based selection).
#### iloc:
the magicall indexes inside the braces, what are they? here is the format:

**\[start row: finish row: row count++ , start column: finish column, coulumn count++]**

In [18]:
table.iloc[0]

scores        20
students     sam
last Name     do
Name: rank1, dtype: object

In [19]:
table.iloc[0:2]

       scores students last Name
rank1      20      sam        do
rank2      19      pam        re

In [21]:
table.iloc[0:3:2]

       scores students last Name
rank1      20      sam        do
rank3      18      jym        fa

In [22]:
table.iloc[0:3, 0]

rank1    20
rank2    19
rank3    18
Name: scores, dtype: int64

In [23]:
table.iloc[0:3, 1]

rank1    sam
rank2    pam
rank3    jym
Name: students, dtype: object

In [26]:
table.iloc[0:3, 0:2]

       scores students
rank1      20      sam
rank2      19      pam
rank3      18      jym

In [27]:
table.iloc[0:3, 0:3]

       scores students last Name
rank1      20      sam        do
rank2      19      pam        re
rank3      18      jym        fa

In [28]:
table

       scores students last Name
rank1      20      sam        do
rank2      19      pam        re
rank3      18      jym        fa
rank4      17      kim       sol

could also be more creative about this indexing! like passing a list to indexes like below:

In [31]:
table.iloc[[0, 1, 3], [0, 2]]

       scores last Name
rank1      20        do
rank2      19        re
rank4      17       sol

what about negative numbers? should they scare us? No, they act like positive numbers, but starting from the **end** of the list!

In [33]:
table.iloc[-3:]

       scores students last Name
rank2      19      pam        re
rank3      18      jym        fa
rank4      17      kim       sol

#### loc: 

uses lables to iterate between defferent indexes.

In [41]:
table.loc['rank1', 'students']

'sam'

here is sth that might confuse you. the code like below:
```python
table.loc \[0, 'students']
```
rises key error. why? becuase at the very time of the creation of that table, we manipulate the index as:
```python
index=\['rank1', 'rank2', 'rank3', 'rank4'])
```
som the first index which is the row number, must now be a lable!

to make sure of understanding this consept, let's make a new dataframe:

In [42]:
new_table = pd.DataFrame({'notes': [0, 1, 2, 3], 'french':['do', 're', 'mi', 'fa']})
new_table.loc[0, 'french']

'do'

as it is shown above, there will not be any problem accessing the row number by its number, with **loc**, but we have to be carefull about the fact that changing the index of the DataFrame index might effect on accessing its attrebutes.

In [45]:
table.loc['rank1', ['scores', 'students']]

scores       20
students    sam
Name: rank1, dtype: object

In [46]:
table.loc[:, ['scores', 'students']]

       scores students
rank1      20      sam
rank2      19      pam
rank3      18      jym
rank4      17      kim